from django.utils.translation import gettext_lazy as _l


TAKE_FOOD = 'Забрать еду'
GIVE_FOOD = 'Отдать еду'
WHAT_DO_YOU_WANT_TO_DO = 'Что ты хочешь сделать?'
RECURRING_GREETING = 'Привет, {}!'
FIRST_GREETING = 'Привет! Я бот для фудшеринга. Мы видимся в первый раз. ' \
                 'Как тебя зовут?'
SEE_YOU = 'Еще увидимся!'
OKAY_I_NEED_TO_KNOW_WHERE_YOU_ARE = 'Хорошо. Мне нужно знать, где ты находишься, ' \
                                    'и я покажу, какую еду предлагают рядом.'
SEND_ME_YOUR_LOCATION = 'Скинь свою локацию в сообщении.'
SEND_CURRENT_LOCATION = 'Отправить текущее местоположение'
OKAY_NAME_YOUR_OFFER = 'Хорошо! Назови, пожалуйста, что ты хочешь отдать.'
CHOOSE_FROM_THE_KEYBOARD = 'Не понимаю тебя :( Выбери один из вариантов на клавиатуре.'
THANK_DEVELOPERS = 'Поблагодарить разработчиков'
SEE_TOS = 'Прочитать условия'
TOS_1 = 'Если вы отдаете продукты, помните, что вы не хотите никому навредить. ' \
        'Не отдавайте через бота некачественные продукты. ' \
        'Фудшеринг — это не способ избавиться от плохой еды.'
TOS_2 = 'Пожалуйста, не занимайтесь торговлей через бота. Если хотите, можно написать символическую цену, ' \
        'но откровенно торговые объявления будут удаляться.'
